"""
Вы играете в игру "Камни": игру для двух игроков с двумя наборами камней по n и m штук. С каждым ходом один игрок может взять один камень (из любого набора) или два камня (по одному из обоих). Когда камень забрали, он выходит из игры. Побеждает игрок, который заберет последний камень. Первый ход за вами.

Вы и ваш оппонент играете оптимально.

Формат ввода
В первой строке содержится два числа n (0≤n≤10), m (0≤m≤10) — количество ваших камней и количество камней у вашего оппонента.

Формат вывода
В единственной строке выведите Lose, если вы заведомо проиграете, и Win, иначе.
"""
n, m = [*map(int, input().split(' '))]
if n % 2 == 0 and m % 2 == 0:
    print('Lose')
else:
    print('Win')
